{
    "2024_w1_USCvsLSU": {
        "newsTitle": "Trojan Circus: USC's Shocking Win Leaves LSU in Hysterics",
        "newsImg": "../img/w1_usc.jpg",
        "newsCaption": "True Freshman USC QB Malachi Nelson Shines as Trojans Overcome Halftime Deficit to Halt LSU",
        "articleText": "In a game that had more twists and turns than a rollercoaster at a funfair, the USC Trojans pulled off a stunning upset against the LSU Tigers. The odds were stacked against them, with LSU being the hefty 10.5-point favorites, but USC had some tricks up their sleeves, and it all started with a true freshman named Malachi Nelson.\n\nLSU fans were feeling pretty confident when starting QB Caleb Williams threw not one, but two interceptions. It was like he was trying to test the limits of how much they could yell 'Geaux Tigers!' in despair. But never fear, because in stepped Malachi Nelson, who went 7 for 8, tossing for 173 yards and two touchdowns, and the USC fans collectively said, 'Caleb who?'\n\nOn the other side of the field, Jayden Daniels looked about as lost as a squirrel in a blender, throwing for a dismal 10/26 with no touchdowns and two interceptions. He might want to consider a career change to professional hide-and-seek.\n\nLSU had a cozy 11-0 lead at halftime, but USC was not ready to throw in the towel. They mounted an epic comeback, ultimately winning 16-11. LSU had one last-ditch effort to snatch victory from the jaws of defeat, but USC's defense stood tall and said, 'Not today, my friends!'\n\nIt was a game for the books, proving once again that in college football, anything can happen. And for Malachi Nelson, well, he's the Trojan horse that LSU never saw coming.",
        "score": "USC 24 - LSU 17",
        "stats": {
            "team1": {
                "QBName": "Malachi Nelson",
                "team": "USC",
                "comp": 7,
                "att": 8,
                "yds": 173,
                "td": 2,
                "int": 0
            },
            "team2": {
                "QBName": "Jayden Daniels",
                "team": "LSU",
                "comp": 10,
                "att": 26,
                "yds": 160,
                "td": 0,
                "int": 2
            }
        }
    },
    "2024_w1_ColoradovsGeorgia": {
        "newsTitle": "Georgia's False Starts on Defense Somehow Lead to a Win in Colorado",
        "newsImg": "../img/w1_georgia.jpg",
        "newsCaption": "Carson Beck Throws Hilarious Touchdown Party, Georgia's -6.5 Favorites Prove Right",
        "articleText": "In a game that looked more like a comedy sketch than a football match, the Georgia Bulldogs somehow managed to claw their way to a 24-17 win over Colorado, despite their defense playing a game of 'Red Light, Green Light' with false starts. It's like they thought the game had a secret bonus round for most flags on the field.\n\nGeorgia's QB Carson Beck, on the other hand, turned the gridiron into his own personal laugh factory. Throwing 8/14 for 188 yards and 3 touchdowns, Beck was like that one uncle at a family BBQ who thinks he's a grill master – except Beck actually knew what he was doing. No interceptions, just pure, unadulterated touchdown goodness.\n\nMeanwhile, Colorado's QB Shedeur Sanders was out there slinging the ball 24/41 for 215 yards, but with only 1 touchdown and an interception to show for it. It's like he was playing darts in the dark – sometimes hitting the board, sometimes hitting the wall.\n\nIn the end, Georgia's chaotic 'start-stop-repeat' defense and Beck's touchdown fiesta proved too much for Colorado. The Bulldogs, as -6.5 favorites, walked away winners, probably scratching their heads and thinking, 'How did we pull that off?' It's like winning a pie-eating contest after accidentally eating the paper plates too.",
        "score": "Georgia 24 - Colorado 17",
        "stats": {
            "team1": {
                "QBName": "Shedeur Sanders",
                "team": "Colorado",
                "comp": 24,
                "att": 41,
                "yds": 215,
                "td": 1,
                "int": 1
            },
            "team2": {
                "QBName": "Carson Beck",
                "team": "Georgia",
                "comp": 8,
                "att": 14,
                "yds": 188,
                "td": 3,
                "int": 0
            }
        }
    },
    "2024_w1_ToledovsOleMiss": {
        "newsTitle": "Dequan Finn's Dominance Propels Toledo to Victory, Heisman Hopes Skyrocket",
        "newsImg": "../img/w1_toledo.jpg",
        "newsCaption": "Toledo QB Dequan Finn Outshines in Mercy Rule Victory Over Ole Miss",
        "articleText": "In the world of college football, where David rarely slays Goliath, the Toledo Rockets just rewrote the script, steamrolling Ole Miss 48-16 in a game that had more twists than a pretzel factory. Picture this: Toledo's QB, Dequan Finn, basically turned the field into his personal playground. He's not just throwing footballs; he's launching rockets. With a stat line of 234 yards, 4 TDs, and zero interceptions, Finn's Heisman hopes aren't just skyrocketing - they're in a different galaxy.\n\nNow, let's talk about Ole Miss QB Jaxon Dart. He was more generous than a grandparent at Christmas, dishing out 6 interceptions. That's right, leading the league in giving away the ball like it's a hot potato. And with a 21/40 for 264 yards, it's like he thought his receivers were playing for Toledo.\n\nFinn wasn't content with just air domination; he decided to rush 9 times for 61 yards and even snagged a touchdown on foot. It's like watching a Swiss Army knife, but instead of tools, it's just different ways to score.\n\nThis wasn't just a victory; it was Toledo saying, 'Mercy rule? More like party time!' Ole Miss might need to check if they accidentally left their defense on the bus. This game had more surprises than a plot twist in a soap opera. And at the end, Toledo stands tall, not just as modest favorites, but as gridiron gladiators.",
        "score": "Toledo 48 - Ole Miss 16",
        "stats": {
            "team1": {
                "QBName": "Jaxon Dart",
                "team": "Ole Miss",
                "comp": 21,
                "att": 40,
                "yds": 264,
                "td": 2,
                "int": 6
            },
            "team2": {
                "QBName": "Dequan Finn",
                "team": "Toledo",
                "comp": 8,
                "att": 15,
                "yds": 234,
                "td": 5,
                "int": 0
            }
        }
    },
    "2024_w1_TexasvsUW": {
        "newsTitle": "UW Steals the Show in Primetime Thriller, Edging Texas 58-52 with Dramatic Pick-6 Victory",
        "newsImg": "../img/w1_uw.jpg",
        "newsCaption": "UW's Unbelievable Victory Over Texas Comes Down to a Costly Coaching Blunder",
        "articleText": "In a game that left fans questioning their life choices, UW managed to overcome the odds and topple Texas in a high-octane, prime-time showdown that felt more like a circus than a football game. With UW being the 10.5 favorites, everyone expected a dominant performance, but what we got was pure gridiron chaos.\n\nBoth quarterbacks, Penix for UW and Ewers for Texas, seemed determined to set records for the number of touchdowns and interceptions in a single game. In total, they combined for a jaw-dropping 12 touchdowns and an eye-watering 9 interceptions, making each pass attempt feel like a game of Russian roulette.\n\nBut the real spectacle happened in the closing moments of the fourth quarter when Texas, facing a tied game, made a coaching decision that will haunt their nightmares. Instead of playing it safe and securing the win, Texas decided to roll the dice with a Hail Mary pass. What followed was an interception that turned into a game-winning pick-6 for UW, leaving fans in stitches and Texas fans in tears.\n\nAmid the madness, UW QB Penix threw for a mind-boggling 424 yards, 6 touchdowns, and somehow managed to squeeze in 4 interceptions. On the other side, Texas QB Ewers wasn't far behind with 405 yards and 6 touchdowns, but he outdid Penix in the interception department with 5 picks.\n\nIn the end, UW walked away with the win, but the real MVP of the night was the comedy of errors that unfolded on the field. It's safe to say that this game will be remembered for a long time, not for its football prowess, but for its hilarious unpredictability.",
        "score": "UW 58 - Texas 52",
        "stats": {
            "team1": {
                "QBName": "Michael Penix Jr",
                "team": "UW",
                "comp": 20,
                "att": 30,
                "yds": 424,
                "td": 6,
                "int": 4
            },
            "team2": {
                "QBName": "Quinn Ewers",
                "team": "Texas",
                "comp": 18,
                "att": 37,
                "yds": 405,
                "td": 6,
                "int": 5
            }
        }
    },
    "2024_w2": {
        "newsTitle": "Week 2 Wrap-Up: Underdogs Top Dogs and Quarterbacks Light It Up",
        "newsImg": "../img/2024_w2_newsimg.jpg",
        "newsCaption": "From Last to Blast: Tom's LSU Shocks the Gridiron World",
        "articleText": "If last week's games were an appetizer, Week 2 was the main course with extra hot sauce! Football fans, buckle up, because we've got some tales to tell.\nLSU's Remarkable Turnaround: Tom's Tigers Roar\nTalk about a Cinderella story! Last week, Tom's LSU squad was chilling at the bottom of the coaches' poll, probably making friends with dust bunnies. Fast forward to this week, and boom! They've flipped the script, toppling Adrian's top-ranked team with a 36-22 victory. LSU's Jayden Daniels went from a shaky Week 1 to throwing a fiesta in Week 2 with a stunning 75% completion rate and 5 TDs. That's not just a comeback; that's a rocket launch!\nQuarterback Carousel: Ewers, Penix Jr., Dart, and the Gang\nQuinn Ewers of Texas, after a roller coaster in Week 1, came back strong with an 88% completion rate, throwing for 289 yards. It's like he went from playing pinball to performing surgery on the field. Meanwhile, Michael Penix Jr. of Washington might need a new pair of gloves for all the throws he's making - 353 yards and 4 TDs, but also 4 INTs. Maybe he's just too generous?\nJaxon Dart of Ole Miss is making a statement, too. After a rocky start in Week 1, he's now zipping the ball with an 81.25% completion rate and 348 yards. That's not playing darts; that's launching rockets!\nThe Spread Speaks: Underdogs had their day this week. Tom's LSU beating Adrian despite an 8.5 point spread? That's like showing up to a knife fight with a bazooka.\nClose Calls: Kaveh and Bob's showdown was a nail-biter with a 24-30 finish. If football games were movies, this one was a thriller.\nThe Points Fiesta: JP's Ole Miss putting up 48 points against Min's Washington. If this were a basketball game, we'd still be impressed.\nGame Analysis\nMatchup: Tom (LSU) vs. Adrian (Toledo)\nIn a David vs. Goliath scenario, Tom's LSU, once at the bottom of the pile, emerged as the giant slayers against Adrian's Toledo. Jayden Daniels was the star, transforming from Week 1's uncertainty to Week 2's hero with a 75% completion rate and 5 TDs. Adrian's Toledo, on the other hand, seemed to struggle to find their rhythm, a sharp contrast from their Week 1 performance. This game was a testament to the unpredictability of football and Tom's strategic acumen.\nMatchup: Kaveh (Georgia) vs. Bob (Texas)\nThis was a clash of titans, with both quarterbacks showing impressive skills. Quinn Ewers of Texas displayed a drastic improvement from Week 1, with an 88% completion rate. On the other side, Carson Beck for Kaveh's Georgia also showed improvement, but it wasn't enough to clinch the win. This game was a showcase of offensive firepower and hinted at potential defensive vulnerabilities on both sides.\nMatchup: Log (Colorado) vs. Chen (USC)\nLog's Colorado, led by Shedeur Sanders, rebounded from their Week 1 defeat with a solid performance. Sanders' 68.42% completion rate and 4 TDs were crucial in overcoming Chen's USC. Caleb Williams of USC, after a dismal Week 1, couldn't manage to turn the tide, struggling with two interceptions. This game underscored the importance of consistency and adapting strategies from week to week.\nMatchup: Min (Washington) vs. JP (Ole Miss)\nJP's Ole Miss, led by Jaxon Dart's remarkable 81.25% completion rate and 348 yards, was a force to be reckoned with. Dart's performance, along with a balanced offensive strategy, overwhelmed Min's Washington, despite Michael Penix Jr.'s impressive 353 yards and 4 TDs. This game was a high-scoring affair, with Ole Miss showcasing a more efficient and potent offense.\nIn conclusion, Week 2 was a roller coaster that would make even the toughest theme park enthusiast queasy. We've seen underdogs become top dogs, quarterbacks turning into magicians, and standings that look like they've been shuffled by a Vegas dealer. Can't wait to see what Week 3 brings. Maybe some actual defense? Just a thought.\nStay tuned for more football follies, folks!",
        "score": ""
    },
    "2024_w3_heisman": {
        "newsTitle": "The Heisman Hysteria",
        "newsImg": "../img/2024_w2_heisman.jpg",
        "newsCaption": "The Best, the Worst, and the 'Keep an Eye On This Guy'",
        "articleText": "Alright, folks, let's cut through the gridiron chaos and talk Heisman. We're not here to hand out participation trophies; it's all about the cream of the crop, the top dogs, and... well, the guys who should probably consider a career in something other than football.\nTop 3 Heisman Contenders:\n* Jayden Daniels, LSU: This guy's putting up numbers like he's in a video game - 736 yards and 10 touchdowns. Sure, he's only completing 60.66% of his passes, but who cares when you're scoring more than a teenager on prom night? He's like the cool kid in school - not perfect, but everyone wants to be him.\n* Quinn Ewers, Texas: Talk about a human highlight reel! 1,065 yards, 13 touchdowns - this kid's arm must be made of some space-age material. Yeah, he's got 9 interceptions, but no risk, no reward, right? He's like that daredevil who does backflips on a motorcycle - you're not sure if he'll land it, but you can't look away.\n* Michael Penix Jr., Washington: With a name like that, he's got to be good, right? 1,030 yards and 13 TDs say yes. 11 interceptions say, \"Well, maybe?\" Riding with Penix is like dating someone who's great 62.96% of the time but a nightmare the rest.\nKeep an Eye On: Dequan Finn, Toledo: This guy's like a stealth bomber - 593 yards, 11 TDs, and flying under the radar. He might not be making headlines now, but give it time. He could sneak up on the big boys like a ninja in the night.\nThe 'Thanks for Trying' Award Goes To:\n- Ole Miss's Jaxon Dart - 844 yards, 8 TDs, and 67.71% completion. But 11 interceptions? It's like he thinks he gets points for giving the ball away. Still, with a name like Jaxon Dart, he's at least winning in the cool name department.\n- Shedeur Sanders (Colorado) - Sanders is like that new burger joint that looks good but then you find out they use tofu instead of beef. 704 yards and 9 TDs are respectable, but with 4 INTs and a team that’s sinking faster than my hopes in a dating app, he’s not smelling the Heisman anytime soon.\nSo, who's taking home the Heisman? It's like choosing the best reality TV show - they're all a bit messy, but that's why we love them. If I had to bet, I'd put my money on Jayden Daniels from LSU. He's like a magician - sure, he might saw the lady in half, but you can't help but be impressed. Just pray he doesn't make the trophy disappear.",
        "score": ""
    }


}
