{
    "2024_daniels_walkoff": {
        "newsTitle": "Gridiron Gags Gone Wrong: A Rollercoaster Interview with Daniels and Beck",
        "newsImg": "../img/daniels_walkoff.jpeg",
        "newsCaption": "Exclusive interview with Jayden Daniels and Carson Beck",
        "articleText": "Interviewer: Alright, folks, it's time to shake things up with some offbeat humor! Today, we've got the fiery Jayden Daniels and the perpetually exhausted Carson Beck in the house. Let's dive right in, shall we?\n\n[Jayden walks in, exuding confidence, while Carson follows behind with a tired smile.]\n\nInterviewer: Jayden, my man, how's life treating you? Last time we checked, you were leading the Heisman race, but then it seems you decided to take a nosedive in the standings. What's up with that?\n\nJayden: [With a cocky grin] Oh, you know how it is, sometimes you're riding high, and other times, you're face-planting in the mud. But hey, who needs a Heisman when you've got the love of the game... and a killer arm?\n\nInterviewer: Spoken like a true optimist! Now, Carson, buddy, your coach recently threw some shade your way, calling you the worst QB in the league. How does that make you feel?\n\nCarson: [With a weary shrug] Eh, it's just another Monday in the life of Carson Beck, the guy who couldn't hit the broad side of a barn if his life depended on it. But hey, maybe I'll surprise everyone and throw a touchdown pass with my eyes closed next game. You never know!\n\nInterviewer: Gotta love that can-do attitude, Carson! Now, let's talk playoffs. Carson, with the recent struggles the team's been facing and the coach's comments, do you still think there's a chance for a playoff run this season?\n\nCarson: [Rubbing his eyes tiredly] Playoff run? Look, I'll be honest with you, it's been a rough ride. We've got more chance of finding a unicorn in the locker room than making it to the playoffs at this rate. But hey, stranger things have happened, right?\n\nInterviewer: Optimism at its finest, folks! Now, let's delve into something a bit more serious, Jayden. Your athleticism is undeniable, but it seems like every time you hit the field, you end up sidelined with an injury. What's going on there?\n\n[Jayden's demeanor shifts, his expression hardening as he clenches his jaw.]\n\nJayden: You really want to go there, huh? Look, injuries are part of the game, okay? It's not like I'm out there trying to break bones on purpose. But when you're playing as hard as I do, sometimes things happen. Got it?\n\n[Jayden's tone is sharp, his frustration evident. The interviewer chuckles nervously, trying to lighten the mood.]\n\nInterviewer: Whoa there, Jayden! Chill out before you get worked up and get hurt again. We don't need another injury report on our hands, am I right?\n\n[Jayden glares at the interviewer, clearly not finding the comment amusing. He stands up abruptly, his frustration boiling over.]\n\nJayden: You think this is funny, huh? You think it's a joke? I'm outta here.\n\n[With that, Jayden storms off the set, leaving behind a stunned interviewer and a bewildered Carson.]\n\nCarson: [Watching Jayden leave, then turning to the camera with a sigh] Well, looks like we've reached the end of another episode. Guess I'll just go back to staring at my playbook until I'm called in to throw another interception.\n\n[The interviewer gives Carson a sympathetic pat on the back as the camera fades out.]"
    },
    "2024_nelson_mcdonalds": {
        "newsTitle": "Quarterback Quarter Pounders: Malachi Nelson's Fast-Food Foray",
        "newsImg": "../img/nelson_mcdonalds.jpeg",
        "newsCaption": "Former 5 star looking for a different profession??",
        "articleText": "Scene: A local McDonald's. The interviewer, Sam, spots Malachi Nelson in line, wearing casual clothes and filling out a job application.\nSam (approaching with a microphone): Malachi Nelson! USC's quarterback! What a surprise to find you here. Sam Rivers from Sports Central. Do you have a minute?\nMalachi Nelson (looking surprised): Uh, sure, Sam. What are you doing at McDonald's?\nSam: Same as you, apparently. But I'm just here for a Big Mac. You, on the other hand, are filling out a job application?\nMalachi Nelson (awkwardly laughing): Yeah, you know, just exploring career options.\nSam: Career options? In fast food?\nMalachi Nelson: Well, our season's not exactly... cooking. Figured I'd try my hand at something that is.\nSam: I have to say, Malachi, it's not every day you see a star quarterback filling out a job application at McDonald's.\nMalachi Nelson (clearly embarrassed): Look, Sam, can we not do this here?\nSam: Oh, come on, Malachi. From throwing long bombs to dropping fries in hot oil – it's a story!\nMalachi Nelson (frustrated): It's not a story, Sam. It's just me trying to figure things out, okay? The season's been rough, and I'm just... exploring options.\nSam: Exploring options, right. Is this like a method acting thing for a new role? 'Quarterback to Quarter Pounder'?\nMalachi Nelson (annoyed): No, it's not a joke, Sam. Can you please just turn off the camera?\nSam: But the public deserves to know! Maybe you're starting a new trend. What's next? The coach working at Taco Bell?\nMalachi Nelson (raising his voice): This isn't funny, okay? I'm just trying to make the best out of a bad situation.\nSam (smirking): Sure, sure. Well, good luck with the application. And hey, if the quarterback thing doesn't work out, maybe you've got a future in fast food.\nMalachi Nelson (turning away, muttering): Just drop it, Sam.\nSam (to the camera): You heard it here first, folks. Malachi Nelson, potentially trading touchdowns for takeout. This is Sam Rivers, bringing you the hottest and freshest news, right from McDonald's.\n[Camera zooms out as Malachi stands awkwardly in line, trying to ignore the camera, while Sam walks away with a grin.]"
    },
    "2024_sanders_log": {
        "newsTitle": "EXCLUSIVE: Trouble in Colorado? Shedeur Sanders Opens Up on Team's Turmoil",
        "newsImg": "../img/sanders_log.jpeg",
        "newsCaption": "Shedeur Sanders opens up about his problem with his coach, Logan",
        "articleText": "Interviewer: \"Ladies and gentlemen, welcome to the most anticipated interview of the season! We're here with the star quarterback of Colorado, Shedeur Sanders. Shedeur, thanks for joining us. First off, how's the season treating you?\"\nShedeur: \"Thanks for having me. Well, you know, it's been a season of 'learning experiences', if you catch my drift.\"\nInterviewer: \"Ah, I see. Speaking of 'learning experiences', how's it working with your new coach, Log?\"\nShedeur: \"Oh, Coach Log, yeah. You know, he's unique. If football were about collecting logs instead of scoring touchdowns, we'd be undefeated!\"\nInterviewer: \"Haha, that's a good one! But on a serious note, you've had some tough games. What do you think is missing in those close losses?\"\nShedeur: \"Well, I think we're just a few... let's call them 'strategic adjustments' away from victory. Like maybe realizing football is played on a field, not on paper. Or that the end zone is forward, not backward.\"\nInterviewer: \"Interesting perspective! And how do you feel about your personal performance this season?\"\nShedeur: \"I'm doing my best, but you know, it's tough when the play calls are more unpredictable than a weather forecast. I mean, one minute it's sunny, next minute, Coach Log thinks we're in a blizzard!\"\nInterviewer: \"That does sound challenging. Now, you've had a standout performance against USC. What was different in that game?\"\nShedeur: \"Ah, USC. That day, Coach Log accidentally read the playbook upside down. Turns out, it was just what we needed!\"\nInterviewer: \"Haha, a bit of accidental genius, then? Lastly, Shedeur, any words for your fans sticking with you through this rollercoaster season?\"\nShedeur: \"Absolutely. To our fans, I promise, we're working hard to turn things around. And to Coach Log, if you're listening, maybe let's try reading the playbook right side up next game. Just a thought!\"\nInterviewer: \"One last question before you go, Shedeur. With the current standings, do you think Colorado has a shot at making the playoffs?\"\nShedeur: \"Playoffs? Well, I'm an optimist. I believe if a bumblebee can fly without understanding aerodynamics, we can make the playoffs without understanding our coach's strategies. It's all about believing in the impossible, right?\"\nInterviewer: \"That's a great attitude. Thanks again, Shedeur, and good luck with the rest of the season!\"\nShedeur: \"Thanks! We're going to need all the luck, and maybe a bit of magic too!\""

    },
    "2024_heisman_fight": {
        "newsTitle": "Heisman Contenders Clash: Ewers vs. Finn",
        "newsImg": "../img/heisman_fight.jpeg",
        "newsCaption": "Amidst the intensifying Heisman race, shocking allegations emerge: Ewers throws a punch?",
        "articleText": "Interviewer: Welcome to a special evening with three of college football's elite quarterbacks: Dequan Finn from Toledo, Quinn Ewers from Texas, and Michael Penix Jr. from Washington. It's an honor to have you all.\nDequan Finn: Thanks for having us.\nQuinn Ewers: Excited to be here.\nMichael Penix Jr.: Looking forward to the chat.\nInterviewer: Dequan, you've achieved a remarkable QBR of 208.7 and a completion rate of 68.2%. What's your strategy?\nDequan Finn: It's about discipline and...\nQuinn Ewers (interrupting): And playing against high school teams, right? [chuckles]\nDequan Finn: Excuse me? At least I...\nInterviewer: Moving on, Quinn, you're leading with 1,580 passing yards and 22 total TDs. What drives your success?\nQuinn Ewers: Pure skill and a killer offense. It's not just about stats.\nMichael Penix Jr. (jokingly): Or about the referees being on your side?\nQuinn Ewers: Hey! That's uncalled for.\nInterviewer: Michael, your impressive 193.8 QBR has been a talking point. How do you handle the pressure of being the focal point of Washington's offense?\nMichael Penix Jr.: I focus on my game. That's all I can control.\nInterviewer: Let's discuss Heisman ratings. Dequan, you're at 32.23, leading Quinn at 29.8 and Michael at 26.96. Thoughts?\nDequan Finn: The numbers show who's really at the top.\nQuinn Ewers: Are you saying you're better than me?\nDequan Finn: The stats don't lie.\nQuinn Ewers (standing up angrily): You think you're some big shot?\nDequan Finn (also standing): Better than a pretty boy with a mullet.\nQuinn suddenly swings at Dequan, connecting with his jaw. Dequan retaliates with a swift punch to Quinn's stomach.\nMichael Penix Jr. (rushing to intervene): Guys, stop it! This isn't the way!\nBut it's too late. The two quarterbacks are exchanging blows, knocking over chairs and spilling water everywhere.\nInterviewer: Security! We need help here!\nSecurity rushes in, trying to separate Quinn and Dequan, who are still throwing punches. Michael and the interviewer stand back, shocked.\nInterviewer: We're cutting to a break! This is completely unexpected and unacceptable. We apologize to our viewers."

    }
    


}
